{
   "allow_add_mods" : true,
   "custom_icons" : false,
   "dependencies" : [
      {
         "fileId" : 2809667982.0,
         "localId" : "6db9449a-2b49-4ee7-8711-ad91ff4119ec",
         "name" : "E"
      }
   ],
   "description" : "The most anticipated sequel of all time!\r\nPlease like and add to favourites so this mod can survive in the algorithm!\r\n\r\nThis mod is constantly updated, so leave your feedback in the comments!\r\n\r\nBEFORE YOU PLAY!\r\nDo you want more memes?\r\nIf so install DLL mods to add more to the experience!\r\nSteps:\r\n1. Go to https://github.com/QuestionableM/SM-DLL-Injector/releases/latest\r\n2. Download DLL-Injector-Installer.exe and run it.\r\n3. Go to https://github.com/QuestionableM/SM-CustomAudioExtension/releases/latest\r\n4. Download CustomAudioExtension.dll\r\n5. Go to Scrap Mechanic in your steam library\r\n6. Press the small cogwheel on the same bar as the \"play\" button\r\n7. Go to \"manage\", then click \"bowse local files\"\r\n8. Go into the folder called \"Release\"\r\n9. In there create a new folder called \"DLLModules\"\r\n10. Move CustomAudioExtension.dll into that folder\r\n\r\nPROFIT!\r\n\r\n-----------------ALL UPDATES AND PATCHONTES CAN BE FOUND BELOW-----------------\r\n___________\r\n|> Day 0 patch <|\r\n \\_version 1.0.1_/\r\n● Added /switchHUD to toggle custom HUD elements\r\n● Made collision destruction less violent\r\n● Made stars in the night sky bigger to circumvent Scrap Mechanic's rendering issues\r\n● Turned off silly meter as it is unfinished\r\n● Fixed incompatibility with fant mod by disabling the fant mod (To be fixed but I'm lazy)\r\n● Added the missing \"2\" in the title that's displayed in game\r\n● Fixed collision destruction bugs\r\n__________\r\n|>Version 1.1<|\r\n‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾\r\n● Optimized the code responsible for playing the metal pipe sound effect\r\n● Added new slash commands to improve user experience\r\n● \" /noaggrocreations \" bots are no longer agressive to creations\r\n● \" /popcapsules \" pops all bot capsules that are currently within the render distance\r\n● \" /dropscrap \" enables and disables haybots dropping their spines upon death\r\n● \" /place \" places any harvestable of your liking on the ground where you are looking\r\n● ╠> \" stone \" places a random stone formation\r\n● ╠> \" birch \" places a random birch tree\r\n● ╠> \" leafy \" places a random oak (? there is no real counterpart to this tree type) tree\r\n● ╠> \" pine \" places a random pine tree\r\n● ╚> \" spruce \" places a random spruce tree (in case you already want to put up Christmas decorations)\r\n● \" /clear \" clears all creations within render distance. ⚠︎WARNING⚠︎ unlike this command in creative mode this one does not have a warning popup so use it wisely!\r\n● \" /collisiondestruction \" toggles collision destruction as it is not final and can lead to problems while playing\r\n● \" /ammoconsumption \" toggles ammo consumption by handheld and mounted guns (ammo includes not only potatoes but also water, chemicals, and anything that can be shot, vaccum pump is exceluded at the moment)\r\n● \" /fuelconsumption \" toggles fuel consumption by engines, thrusters, etc\r\n● \" /partupgrade \" toggles the ability to upgrade interactive parts with component kits\r\n● Added a chat message on startup informing the player about how to turn off HUD elements\r\n● Removed the Mod database from dependencies, cutting down on load times and errors in console on startup\r\n___________\r\n|>Version 1.1.1<|\r\n‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾\r\n● Slightly reduced file size\r\n● Fixed a bug where \" /partupgrade \" command would use the state of \" /ammoconsumption \" for the value (on/off) it displayed in chat\r\n● Fixed a bug where stars would stop rotating during sunrise\r\n● Fixed a bug where stars rotation algorithm would not reset and playing in a world without logging out for long periods of time could lead to errors\r\n● Fixed some typos\r\n● Patch notes are now available at this item's \"updates\" page\r\n___________\r\n|>Version 1.1.2<|\r\n‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾\r\n● Fixed rain audio not looping properly\r\n● Slightly reduced file size\r\n● Added the effect of a galaxy in the night sky\r\n__________\r\n|>Version 1.2<|\r\n‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾\r\n● Meet the Peter block! It's like both gels from portal 2, but mixed!\r\n● Reordered update versions more akkin to minecraft, for easier navigation\r\n● Updated localization files",
   "fileId" : 3088910657,
   "localId" : "677c9cdc-4a3f-4523-9b3d-2602c834ceb7",
   "name" : "E Mod 2 - The video game",
   "type" : "Custom Game",
   "version" : 0
}
